app/views/static_pages/_pcv.html.erb

  <div class="row">
    <% Language.all.order(:progress).reverse.each do |c| %>
---
SELECT "languages".* FROM "languages"  ORDER BY "languages"."progress" ASC