app/views/static_pages/home.html.erb

                    <div class="row">
                      <% Language.all.order(:progress).reverse.each do |c| %>
---
SELECT "languages".* FROM "languages"  ORDER BY "languages"."progress" ASC


                    <% Meeting.all.order(:date).reverse.each do |meet|%>
---
SELECT "meetings".* FROM "meetings"  ORDER BY "meetings"."date" ASC


                    <% Friend.all.order(:created_at).reverse.each do |friend|%>
---
SELECT "friends".* FROM "friends"  ORDER BY "friends"."created_at" ASC


                        <% Project.all.order(:created_at).each do |proj|%>
---
SELECT "projects".* FROM "projects"  ORDER BY "projects"."created_at" ASC

                            <% if a[i] != nil%>
                              <%= image_tag(Language.where(id:a[i]).first.logolang, size:"50")%>,
                            <%end%>
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = $1  ORDER BY "languages"."id" ASC LIMIT 1  [["id", 0]]

              <% b=1%>
              <% Project.all.each do |proj|%>
---
SELECT "projects".* FROM "projects"

        <ul class="learn list-unstyled">
          <% Language.all.each do |lang| %>
---
SELECT "languages".* FROM "languages"

        <div class="row">
            <% Friend.all.each do |friend|%>
---
SELECT "friends".* FROM "friends"