app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("name", "url", "logobrand", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Simplon Roubaix"], ["url", "http://simplon.co/roubaix/"], ["logobrand", "simplonroubaix.png"], ["created_at", "2016-03-08 08:39:22.341187"], ["updated_at", "2016-03-08 08:39:22.341187"]]