app/controllers/languages_controller.rb

  def create
    @language = Language.new(language_params)

    respond_to do |format|
      if @language.save
---
INSERT INTO "languages" ("name", "description", "progress", "logolang", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "toto"], ["description", "toto"], ["progress", 50], ["logolang", "ruby.jpeg"], ["created_at", "2016-03-10 13:35:40.138163"], ["updated_at", "2016-03-10 13:35:40.138163"]]

  def update
    respond_to do |format|
      if @language.update(language_params)
---
UPDATE "languages" SET "logolang" = $1, "updated_at" = $2 WHERE "languages"."id" = $3  [["logolang", "html5.png"], ["updated_at", "2016-03-08 09:58:18.240916"], ["id", 1]]

  def destroy
    @language.destroy
---
DELETE FROM "languages" WHERE "languages"."id" = $1  [["id", 4]]

    def set_language
      @language = Language.find(params[:id])
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT 1  [["id", 4]]