app/controllers/meetings_controller.rb

  def create
    @meeting = Meeting.new(meeting_params)

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "place", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Semaine du numérique"], ["place", "Québec"], ["date", "2016-04-04 08:55:00.000000"], ["created_at", "2016-03-08 08:56:08.316278"], ["updated_at", "2016-03-08 08:56:08.316278"]]

  def update
    respond_to do |format|
      if @meeting.update(meeting_params)
---
UPDATE "meetings" SET "flyer" = $1, "url" = $2, "updated_at" = $3 WHERE "meetings"."id" = $4  [["flyer", "logo_semaine_numerique_small.png"], ["url", "http://semainenumerique.com/#accueil"], ["updated_at", "2016-03-08 09:18:26.388915"], ["id", 2]]