app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "client", "description", "progress", "visual", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "progress" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["progress", 40], ["updated_at", "2016-03-11 11:15:08.256877"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)